[NoCoverage] Block removal mutation
Application/Core/Application/FuncionariosApplicationService.cs:16:9
         private readonly IFuncionariosRepository _repository;
 
         public FuncionariosApplicationService(IFuncionariosRepository repository)
-        {
-            _repository = repository;
-        }
+        {}
 
         public Funcionario Insert(Funcionario funcionario)

[NoCoverage] Block removal mutation
Application/Core/Application/FuncionariosApplicationService.cs:21:9
         }
 
         public Funcionario Insert(Funcionario funcionario)
-        {
-            FuncionarioValidation.ValidaFuncionario(funcionario);
-            var response = _repository.Insert(funcionario);
-            return response.Result;
-        }
+        {}
 
         public void Update(Guid codigo,Funcionario funcionario)

[NoCoverage] Statement mutation
Application/Core/Application/FuncionariosApplicationService.cs:22:13
 
         public Funcionario Insert(Funcionario funcionario)
         {
-            FuncionarioValidation.ValidaFuncionario(funcionario);
+            ;
             var response = _repository.Insert(funcionario);
             return response.Result;

[NoCoverage] Block removal mutation
Application/Core/Application/FuncionariosApplicationService.cs:28:9
         }
 
         public void Update(Guid codigo,Funcionario funcionario)
-        {
-            FuncionarioValidation.ValidaCodigoFuncionario(codigo);
-            FuncionarioValidation.ValidaFuncionario(funcionario);
-            _repository.Update(codigo,funcionario);
-        }
+        {}
 
         public void Delete(Guid codigo)

[NoCoverage] Statement mutation
Application/Core/Application/FuncionariosApplicationService.cs:29:13
 
         public void Update(Guid codigo,Funcionario funcionario)
         {
-            FuncionarioValidation.ValidaCodigoFuncionario(codigo);
+            ;
             FuncionarioValidation.ValidaFuncionario(funcionario);
             _repository.Update(codigo,funcionario);

[NoCoverage] Statement mutation
Application/Core/Application/FuncionariosApplicationService.cs:30:13
         public void Update(Guid codigo,Funcionario funcionario)
         {
             FuncionarioValidation.ValidaCodigoFuncionario(codigo);
-            FuncionarioValidation.ValidaFuncionario(funcionario);
+            ;
             _repository.Update(codigo,funcionario);
         }

[NoCoverage] Statement mutation
Application/Core/Application/FuncionariosApplicationService.cs:31:13
         {
             FuncionarioValidation.ValidaCodigoFuncionario(codigo);
             FuncionarioValidation.ValidaFuncionario(funcionario);
-            _repository.Update(codigo,funcionario);
+            ;
         }
 

[NoCoverage] Block removal mutation
Application/Core/Application/FuncionariosApplicationService.cs:35:9
         }
 
         public void Delete(Guid codigo)
-        {
-            FuncionarioValidation.ValidaCodigoFuncionario(codigo);
-            _repository.Delete(codigo);
-        }
+        {}
 
         public Funcionario Get(Guid codigo)

[NoCoverage] Statement mutation
Application/Core/Application/FuncionariosApplicationService.cs:37:13
         public void Delete(Guid codigo)
         {
             FuncionarioValidation.ValidaCodigoFuncionario(codigo);
-            _repository.Delete(codigo);
+            ;
         }
 

[NoCoverage] Block removal mutation
Application/Core/Application/FuncionariosApplicationService.cs:41:9
         }
 
         public Funcionario Get(Guid codigo)
-        {
-            FuncionarioValidation.ValidaCodigoFuncionario(codigo);
-
-            var response = _repository.Get(codigo);
-            return response.Result;
-        }
+        {}
     }
 }
