[NoCoverage] Block removal mutation
Application/Core/Repository/FuncionariosRepository.cs:16:9
         private readonly string ConectionString = "Data Source=(localdb)\\MSSQLLocalDB;Initial Catalog=CrudFuncionarios;Integrated Security=SSPI";
 
         public async Task<Funcionario> Insert(Funcionario funcionario) 
-        {
-            using (var db = new SqlConnection(ConectionString))
-            {
-                await db.OpenAsync();
-                var query = "INSERT INTO Funcionarios (Codigo,Nome,Documento,Idade) OUTPUT Inserted.* VALUES (NEWID(),@Nome,@Documento,@Idade);";
-                var fromDB = await db.QueryAsync<Funcionario>(query, funcionario);
-                return fromDB.FirstOrDefault();
-            }
-        }
+        {}
 
         public async void Update(Guid codigo,Funcionario funcionario)

[NoCoverage] Block removal mutation
Application/Core/Repository/FuncionariosRepository.cs:18:13
         public async Task<Funcionario> Insert(Funcionario funcionario) 
         {
             using (var db = new SqlConnection(ConectionString))
-            {
-                await db.OpenAsync();
-                var query = "INSERT INTO Funcionarios (Codigo,Nome,Documento,Idade) OUTPUT Inserted.* VALUES (NEWID(),@Nome,@Documento,@Idade);";
-                var fromDB = await db.QueryAsync<Funcionario>(query, funcionario);
-                return fromDB.FirstOrDefault();
-            }
+            {}
         }
 

[NoCoverage] Statement mutation
Application/Core/Repository/FuncionariosRepository.cs:19:17
         {
             using (var db = new SqlConnection(ConectionString))
             {
-                await db.OpenAsync();
+                ;
                 var query = "INSERT INTO Funcionarios (Codigo,Nome,Documento,Idade) OUTPUT Inserted.* VALUES (NEWID(),@Nome,@Documento,@Idade);";
                 var fromDB = await db.QueryAsync<Funcionario>(query, funcionario);

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Application/Core/Repository/FuncionariosRepository.cs:22:24
                 await db.OpenAsync();
                 var query = "INSERT INTO Funcionarios (Codigo,Nome,Documento,Idade) OUTPUT Inserted.* VALUES (NEWID(),@Nome,@Documento,@Idade);";
                 var fromDB = await db.QueryAsync<Funcionario>(query, funcionario);
-                return fromDB.FirstOrDefault();
+                return fromDB.First();
             }
         }

[NoCoverage] Block removal mutation
Application/Core/Repository/FuncionariosRepository.cs:27:9
         }
 
         public async void Update(Guid codigo,Funcionario funcionario)
-        {
-            funcionario.Codigo = codigo;
-            using (var db = new SqlConnection(ConectionString))
-            {
-                await db.OpenAsync();
-                var query = "UPDATE Funcionarios SET Nome = @Nome, Documento = @Documento, Idade = @Idade WHERE Codigo = @Codigo;";
-                await db.QueryAsync(query, funcionario);
-            }
-        }
+        {}
 
         public async void Delete(Guid codigo)

[NoCoverage] Block removal mutation
Application/Core/Repository/FuncionariosRepository.cs:30:13
         {
             funcionario.Codigo = codigo;
             using (var db = new SqlConnection(ConectionString))
-            {
-                await db.OpenAsync();
-                var query = "UPDATE Funcionarios SET Nome = @Nome, Documento = @Documento, Idade = @Idade WHERE Codigo = @Codigo;";
-                await db.QueryAsync(query, funcionario);
-            }
+            {}
         }
 

[NoCoverage] Statement mutation
Application/Core/Repository/FuncionariosRepository.cs:33:17
             {
                 await db.OpenAsync();
                 var query = "UPDATE Funcionarios SET Nome = @Nome, Documento = @Documento, Idade = @Idade WHERE Codigo = @Codigo;";
-                await db.QueryAsync(query, funcionario);
+                ;
             }
         }

[NoCoverage] Block removal mutation
Application/Core/Repository/FuncionariosRepository.cs:38:9
         }
 
         public async void Delete(Guid codigo)
-        {
-            using (var db = new SqlConnection(ConectionString))
-            {
-                await db.OpenAsync();
-                var query = $"DELETE FROM Funcionarios WHERE Codigo = '{codigo}'";
-                var clientes = await db.ExecuteAsync(query,codigo);
-            }
-        }
+        {}
 
         public async Task<Funcionario> Get(Guid codigo)

[NoCoverage] Block removal mutation
Application/Core/Repository/FuncionariosRepository.cs:40:13
         public async void Delete(Guid codigo)
         {
             using (var db = new SqlConnection(ConectionString))
-            {
-                await db.OpenAsync();
-                var query = $"DELETE FROM Funcionarios WHERE Codigo = '{codigo}'";
-                var clientes = await db.ExecuteAsync(query,codigo);
-            }
+            {}
         }
 

[NoCoverage] Block removal mutation
Application/Core/Repository/FuncionariosRepository.cs:48:9
         }
 
         public async Task<Funcionario> Get(Guid codigo)
-        {
-            using (var db = new SqlConnection(ConectionString))
-            {
-                await db.OpenAsync();
-                var query = $"SELECT * FROM Funcionarios WHERE Codigo = '{codigo}'";
-                var fromDB = await db.QueryAsync<Funcionario>(query);
-                return fromDB.FirstOrDefault();
-            }
-        }
+        {}
     }
 }

[NoCoverage] Block removal mutation
Application/Core/Repository/FuncionariosRepository.cs:50:13
         public async Task<Funcionario> Get(Guid codigo)
         {
             using (var db = new SqlConnection(ConectionString))
-            {
-                await db.OpenAsync();
-                var query = $"SELECT * FROM Funcionarios WHERE Codigo = '{codigo}'";
-                var fromDB = await db.QueryAsync<Funcionario>(query);
-                return fromDB.FirstOrDefault();
-            }
+            {}
         }
     }

[NoCoverage] String mutation
Application/Core/Repository/FuncionariosRepository.cs:52:29
             using (var db = new SqlConnection(ConectionString))
             {
                 await db.OpenAsync();
-                var query = $"SELECT * FROM Funcionarios WHERE Codigo = '{codigo}'";
+                var query = $"";
                 var fromDB = await db.QueryAsync<Funcionario>(query);
                 return fromDB.FirstOrDefault();

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Application/Core/Repository/FuncionariosRepository.cs:54:24
                 await db.OpenAsync();
                 var query = $"SELECT * FROM Funcionarios WHERE Codigo = '{codigo}'";
                 var fromDB = await db.QueryAsync<Funcionario>(query);
-                return fromDB.FirstOrDefault();
+                return fromDB.First();
             }
         }
