[Killed] Block removal mutation
Application/Core/Validations/FuncionarioValidation.cs:12:9
     {
 
         public static void ValidaFuncionario(Funcionario funcionario)
-        {
-            if (string.IsNullOrWhiteSpace(funcionario.Documento))
-                throw new Exception("Documento inválido");
-
-            if (funcionario.Idade <= 0)
-                throw new Exception("Idade informada inválida");
-
-            if (string.IsNullOrWhiteSpace(funcionario.Nome))
-                throw new Exception("Nome informado inválido");
-        }
+        {}
 
         public static void ValidaCodigoFuncionario(Guid codigo)

[Killed] Negate expression
Application/Core/Validations/FuncionarioValidation.cs:13:17
 
         public static void ValidaFuncionario(Funcionario funcionario)
         {
-            if (string.IsNullOrWhiteSpace(funcionario.Documento))
+            if (!(string.IsNullOrWhiteSpace(funcionario.Documento)))
                 throw new Exception("Documento inválido");
 

[Killed] Statement mutation
Application/Core/Validations/FuncionarioValidation.cs:14:17
         public static void ValidaFuncionario(Funcionario funcionario)
         {
             if (string.IsNullOrWhiteSpace(funcionario.Documento))
-                throw new Exception("Documento inválido");
+                ;
 
             if (funcionario.Idade <= 0)

[Killed] Equality mutation
Application/Core/Validations/FuncionarioValidation.cs:16:17
             if (string.IsNullOrWhiteSpace(funcionario.Documento))
                 throw new Exception("Documento inválido");
 
-            if (funcionario.Idade <= 0)
+            if (funcionario.Idade < 0)
                 throw new Exception("Idade informada inválida");
 

[Killed] Negate expression
Application/Core/Validations/FuncionarioValidation.cs:16:17
             if (string.IsNullOrWhiteSpace(funcionario.Documento))
                 throw new Exception("Documento inválido");
 
-            if (funcionario.Idade <= 0)
+            if (!(funcionario.Idade <= 0))
                 throw new Exception("Idade informada inválida");
 

[Killed] Statement mutation
Application/Core/Validations/FuncionarioValidation.cs:17:17
                 throw new Exception("Documento inválido");
 
             if (funcionario.Idade <= 0)
-                throw new Exception("Idade informada inválida");
+                ;
 
             if (string.IsNullOrWhiteSpace(funcionario.Nome))

[Killed] String mutation
Application/Core/Validations/FuncionarioValidation.cs:17:37
                 throw new Exception("Documento inválido");
 
             if (funcionario.Idade <= 0)
-                throw new Exception("Idade informada inválida");
+                throw new Exception("");
 
             if (string.IsNullOrWhiteSpace(funcionario.Nome))

[Killed] Negate expression
Application/Core/Validations/FuncionarioValidation.cs:19:17
             if (funcionario.Idade <= 0)
                 throw new Exception("Idade informada inválida");
 
-            if (string.IsNullOrWhiteSpace(funcionario.Nome))
+            if (!(string.IsNullOrWhiteSpace(funcionario.Nome)))
                 throw new Exception("Nome informado inválido");
         }

[Killed] Statement mutation
Application/Core/Validations/FuncionarioValidation.cs:20:17
                 throw new Exception("Idade informada inválida");
 
             if (string.IsNullOrWhiteSpace(funcionario.Nome))
-                throw new Exception("Nome informado inválido");
+                ;
         }
 

[Killed] String mutation
Application/Core/Validations/FuncionarioValidation.cs:20:37
                 throw new Exception("Idade informada inválida");
 
             if (string.IsNullOrWhiteSpace(funcionario.Nome))
-                throw new Exception("Nome informado inválido");
+                throw new Exception("");
         }
 

[Killed] Block removal mutation
Application/Core/Validations/FuncionarioValidation.cs:24:9
         }
 
         public static void ValidaCodigoFuncionario(Guid codigo)
-        {
-            if (codigo ==  Guid.Empty)
-                throw new Exception("Código informado inválido");
-        }
+        {}
     }
 }

[Killed] Equality mutation
Application/Core/Validations/FuncionarioValidation.cs:25:17
 
         public static void ValidaCodigoFuncionario(Guid codigo)
         {
-            if (codigo ==  Guid.Empty)
+            if (codigo !=  Guid.Empty)
                 throw new Exception("Código informado inválido");
         }

[Killed] Statement mutation
Application/Core/Validations/FuncionarioValidation.cs:26:17
         public static void ValidaCodigoFuncionario(Guid codigo)
         {
             if (codigo ==  Guid.Empty)
-                throw new Exception("Código informado inválido");
+                ;
         }
     }
